# 1. Напишите программу, которая принимает на вход два числа
#    и проверяет, является ли одно число квадратом другого.

# n = int(input())
# m = int(input())

# if n == m ** 2 or m == n ** 2:
#     print("Yes")
# else:
#     print("No")
    
# 2. Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.

# num_max = 0

# пше
#     n = int(input())
#     if n > num_max:
#         num_max = n
# print(num_max)

# 3. Напишите программу, которая будет на вход принимать
#    число N и выводить числа от -N до N

# -------------------------------------- 1 вариант

# num = int(input("введите число: "))
# print(*range(-num, num + 1))
    
# # -------------------------------------- 2 вариант

# num = int(input("введите число: "))
# if num > 0:
#     print(*range(-num, num + 1))
# else:
#     print(*range(-num, num - 1, -1))


# # -------------------------------------- 3 вариант

# num = int(input())
# neg_num = -num
# print(neg_num, end=", ")

# while num != neg_num:
#     if num > 0:
#         neg_num += 1
#     else:
#         neg_num -= 1
#     print(neg_num, end=", ")

# 4. Напишите программу, которая будет принимать на вход дробь
#    и показывать первую цифру дробной части числа.

# num = float(input())
# sec_num = num * 10 % 10

# if sec_num != 0:
#     print(int(sec_num))
# else:
#     print("No")

# 5. Напишите программу, которая принимает на вход число и проверяет,
#    кратно ли оно 5 и 10 или 15, но не 30.

# 10, 15, 20, 40, 45, 50, 70, 75, 80, 100, 105, 110, 130, 135, 140, 160, 165,
# 170, 190, 195, 200, 220, 225, 230, 250, 255, 260, 280, 285, 290, 310, 315, 320,
# 340, 345, 350, 370, 375, 380, 400, 405, 410, 430, 435, 440, 460, 465, 470, 490,
# 495, 500, 520, 525, 530, 550, 555, 560, 580, 585, 590, 610, 615, 620, 640, 645,
# 650, 670, 675, 680, 700, 705, 710, 730, 735, 740, 760, 765, 770, 790, 795, 800,
# 820, 825, 830, 850, 855, 860, 880, 885, 890, 910, 915, 920, 940, 945, 950, 970, 975, 980,

# num = int(input())

# if (num % 5 == 0 and num % 10 == 0 or num % 15 == 0) and num % 30:
#     print("Yes")
# else:
#     print("No")

# 6. Пример проверки ложности утверждения (x ? z ) ? (x > (y ? z))

# for x in range(2):
#     for y in range(2):
#         for z in range(2):
#             if not (x == z or x <= y and z):
#                 print(x, y, z)

